hxming123456/stm32_power_measure_project/Power_measurement_self_fitting_v1.0/Power_measurement_self_fitting_v1.0/Power_measurement_self_fitting_v1.0/src/main.c
	if(key_status != key_backup)   //power on-off
	{
	    if(key_status == 0)
	    {
	    	if(RELAY_CONTR_KEY_READ==0)
	    	{
		    	if(relay_sta==1)
		    		GPIO_SetBits(GPIOC,GPIO_Pin_0);
		    	else
		    		GPIO_ResetBits(GPIOC,GPIO_Pin_0);
		    	Debug_write_coe_info();
		    	relay_sta = ~relay_sta;
	    	}
	    	if(SELF_ADJUST_KEY_READ==0)
	    	{
#if 0
	    		if(operate_mode != 0)
	    			operate_mode = 0;
	    		else
	    			operate_mode = SELF_ADJUST_MODE;
#endif
	    		relay_test();
	    	}
	    	if(EXTERNAL_KEY_READ==0)
	    	{
#if 1
	    		if(operate_mode != 0)
	    			operate_mode = 0;
	    		else
	    			operate_mode = EXTERNAL_ADJUST_MODE;
#endif
	    	}
	    }
		if(operate_mode==0 && RELAY_CONTR_KEY_READ)
		{
			iic_2864_clear_one(KEY_CHANGE);
			lcd_show_pvi_info(0,0,0);
		}
	    key_backup = key_status;
		c = operate_mode + '0';
		Debug_usart_write("mode:",5,INFO_DEBUG);
		Debug_usart_write(&c,1,INFO_DEBUG);
		Debug_usart_write("\r\n",2,INFO_DEBUG);
	}
	initDataPool(&cse7766rx);
}

void change_load_size(uint8_t *ch_sta,uint32_t load_size)
{
#if 1
	if(load_size==1)
					ch_sta[0] = 1;
	else if(load_size==3)
	{
		ch_sta[1] = 1;;
	}
	else if(load_size==6)
	{
		ch_sta[2] = 1;ch_sta[1] = 1;
	}
	else if(load_size==12)
	{
		ch_sta[3] = 1;
	}
	else if(load_size==20)
	{
		ch_sta[3] = 1;ch_sta[2] = 1;ch_sta[1] = 1;ch_sta[0] = 1;
	}
	else if(load_size==50)
	{
		ch_sta[4] = 1;
	}
	else if(load_size==70)
	{
		ch_sta[4] = 1;ch_sta[3] = 1;ch_sta[2] = 1;ch_sta[1] = 1;ch_sta[0] = 1;
	}
	else if(load_size==100)
	{
		ch_sta[4] = 1;ch_sta[5] = 1;
	}
	else if(load_size==170)
	{
		ch_sta[5] = 1;ch_sta[4] = 1;ch_sta[3] = 1;ch_sta[2] = 1;ch_sta[1] = 1;ch_sta[0] = 1;
	}
	else if(load_size==500)
	{
		ch_sta[6] = 1;
	}
	else if(load_size==600)
	{
		ch_sta[6] = 1;ch_sta[5] = 1;ch_sta[4] = 1;
	}
	else if(load_size==1000)
	{
		ch_sta[6] = 1;ch_sta[7] = 1;
	}
	else if(load_size==1500)
	{
		ch_sta[6] = 1;ch_sta[7] = 1;ch_sta[8] = 1;
	}
	else if(load_size==2000)
	{
		ch_sta[6] = 1;ch_sta[7] = 1;ch_sta[8] = 1;ch_sta[9] = 1;
	}
	else if(load_size==2500)
	{
		ch_sta[6] = 1;ch_sta[7] = 1;ch_sta[8] = 1;ch_sta[9] = 1;ch_sta[10] = 1;
	}
	else if(load_size==3000)
	{
		ch_sta[6] = 1;ch_sta[7] = 1;ch_sta[8] = 1;ch_sta[9] = 1;ch_sta[10] = 1;ch_sta[11] = 1;
	}
#endif

}

void operate_ch_relay(uint8_t *ch)
{
	uint8_t i = 0;

	for(i=0;i<16;i++)
	{
		if(ch[i]==0)
		{
			GPIO_ResetBits(ch_io[i],ch_pin[i]);
		}
		else
		{
			GPIO_SetBits(ch_io[i],ch_pin[i]);
		}
	}
}

uint8_t  Check_c76_return_isok(uint8_t *data,uint32_t len)
{
	uint8_t ret = 0;
	uint8_t i = 0;

	if(len < 10)
	{
		return 0;
	}

	for(i=0;i<len;i++)
	{
		if(data[i]=='K')
		{
			break;
		}
		if(data[i]=='\r'||data[i]=='\n'||data[i]==',')
		{
			continue;
		}
		else if(data[i]=='O'||data[i]=='K')
		{
			continue;
		}
		else if(data[i]>='0'&& data[i]<='9')
		{
			continue;
		}
		else
		{
			return 0;
		}
	}

	return 1;
}

uint32_t Get_computer_external_pvi(uint8_t *data,uint32_t len,double *p,double *v,double *i)
{
	uint8_t tmp = 0;
	uint8_t c = 0;
	uint8_t ok_cnt = 0;
	uint8_t m = 0,n = 0;;
	uint8_t y = 0;
	uint8_t ret = 0;
	uint8_t p_buf[10] = {0};
	uint8_t v_buf[10] = {0};
	uint8_t i_buf[10] = {0};
	double p_ret = 0,v_ret = 0,i_ret = 0;

	Debug_usart_write("Go get computer external pvi\r\n",30,INFO_DEBUG);
	Debug_usart_write("c76 data:",9,INFO_DEBUG);
	Debug_usart_write(data,len,INFO_DEBUG);
	Debug_usart_write("start computer\r\n",16,INFO_DEBUG);
	ret = Check_c76_return_isok(data,len);
	if(ret==0)
	{
		return 0;
	}

	while(1)
	{
		if(data[y] >= '0' && data[y] <= '9')
		{
			break;
		}
		else
		{
			y++;
		}
	}

	for(tmp=y;tmp<len;tmp++)
	{
		if(data[tmp] == 'K')
		{
			ok_cnt++;
			if(ok_cnt == 1)
			{
				break;
			}
		}

		if(data[tmp] == ',')
		{
			m++;
			n = 0;
			continue;
		}
		if(m==0)
		{
			p_buf[n] = data[tmp];
			n++;
		}
		if(m==1)
		{
			i_buf[n] = data[tmp];
			n++;
		}
		if(m==2)
		{
			v_buf[n] = data[tmp];
			n++;
		}
	}
	Debug_usart_write("stop computer\r\n",16,INFO_DEBUG);
	Debug_usart_write("start string to float\r\n",23,INFO_DEBUG);
	Debug_usart_write(p_buf,str_len(p_buf),INFO_DEBUG);
	Debug_usart_write("\r\n",2,INFO_DEBUG);
	string_to_flodou(&p_ret,p_buf,str_len(p_buf));

	Debug_usart_write(v_buf,str_len(v_buf),INFO_DEBUG);
	Debug_usart_write("\r\n",2,INFO_DEBUG);
	string_to_flodou(&v_ret,v_buf,str_len(v_buf)-3);

	Debug_usart_write(i_buf,str_len(i_buf),INFO_DEBUG);
	Debug_usart_write("\r\n",2,INFO_DEBUG);
	string_to_flodou(&i_ret,i_buf,str_len(i_buf));

	Debug_usart_write("stop string to float\r\n",22,INFO_DEBUG);

	*p = p_ret/1000;
	*v = v_ret/1000;
	*i = i_ret/1000;

	Debug_usart_write("out get computer external pvi\r\n",31,INFO_DEBUG);
	return 1;
}

void Send_result_to_c76(uint8_t result,double p_a,double p_b,double i_a,double i_b,double v_coe)
{
	uint8_t send_data[50] = {"AT+C76END=0,"};
	uint8_t p_a_buf[10] = {0};
	uint8_t p_b_buf[10] = {0};
	uint8_t i_a_buf[10] = {0};
	uint8_t i_b_buf[10] = {0};
	uint8_t v_coe_buf[10] = {0};

	uint8_t test_buf[10] = {0};

	double p_a_tmp = p_a;
	double p_b_tmp = p_b;
	double i_a_tmp = i_a;
	double i_b_tmp = i_b;
	double v_coe_tmp = v_coe;

	if(result==1)
	{
		send_data[10] = '1';
	}
	else
	{
		send_data[10] = '0';
	}

	if(p_a_tmp<0)
			p_a_tmp = -p_a;
	if(p_b_tmp<0)
			p_b_tmp = -p_b;
	if(i_a_tmp<0)
			i_a_tmp = -i_a;
	if(i_b_tmp<0)
			i_b_tmp = -i_b;
	if(v_coe_tmp<0)
			v_coe_tmp = -v_coe;
#if 1
	if(p_a < 0)
	{
		Debug_usart_write("-",1,TEST_DEBUG);
	}
	flodou_to_string(p_a_tmp,test_buf,Get_double_mantissa_len(&p_a_tmp),3);
	Debug_usart_write(test_buf,9,TEST_DEBUG);
	Debug_usart_write("\r\n",2,TEST_DEBUG);

	if(p_b < 0)
	{
			Debug_usart_write("-",1,TEST_DEBUG);
	}
	flodou_to_string(p_b_tmp,test_buf,Get_double_mantissa_len(&p_b_tmp),3);
	Debug_usart_write(test_buf,9,TEST_DEBUG);
	Debug_usart_write("\r\n",2,TEST_DEBUG);

	if(i_a < 0)
	{
		Debug_usart_write("-",1,TEST_DEBUG);
	}
	flodou_to_string(i_a_tmp,test_buf,Get_double_mantissa_len(&i_a_tmp),3);
	Debug_usart_write(test_buf,9,TEST_DEBUG);
	Debug_usart_write("\r\n",2,TEST_DEBUG);

