hxming123456/stm32_power_measure_project/Power_measurement_self_fitting_v1.0/Power_measurement_self_fitting_v1.0/Power_measurement_self_fitting_v1.0/src/main.c
		p_6530[i] /= k;
		v_6530[i] /= k;
		i_6530[i] /= k;

		flodou_to_string(p_6530[i],test_buf,5,4);
		Debug_usart_write(test_buf,9,TEST_DEBUG);
		Debug_usart_write("\r\n",2,TEST_DEBUG);


		for(j=0;j<10;j++)
		{
			if(Get_origin_pvi(&data[24*j],24,&p_tmp_7766[j],&v_tmp_7766[j],&i_tmp_7766[j])==1)
			{
				z++;
			}
			else
			{
				p_tmp_7766[j] = 0;
				v_tmp_7766[j] = 0;
				i_tmp_7766[j] = 0;
			}
		}
		if(z==0)
		{
			memset(ch_sta,0x00, sizeof(ch_sta));
			operate_ch_relay(ch_sta);
			return -2;
		}
		for(j=0;j<10;j++)
		{
			p_7766[i] += p_tmp_7766[j];
			v_7766[i] += v_tmp_7766[j];
			i_7766[i] += i_tmp_7766[j];
		}

		flodou_to_string(p_7766[i],test_buf,5,4);
		Debug_usart_write(test_buf,9,TEST_DEBUG);
		Debug_usart_write("\r\n",2,TEST_DEBUG);

		p_7766[i] /= z;
		v_7766[i] /= z;
		i_7766[i] /= z;

		flodou_to_string(p_7766[i],test_buf,5,4);
		Debug_usart_write(test_buf,9,TEST_DEBUG);
		Debug_usart_write("\r\n\r\n",4,TEST_DEBUG);

		if(8*i < 100)
		{
			lcd_change_percent_info(8*i);
		}
	}
	c = i + '0';
	Debug_usart_write(&c,1,INFO_DEBUG);
	lcd_change_percent_info(100);
	Get_coe_a_b_r(p_7766,p_6530,12,&coea_pl,&coeb_pl,&coer_pl);
	Get_coe_a_b_r(&p_7766[12],&p_6530[12],4,&coea_ph,&coeb_ph,&coer_ph);
	Get_coe_a_b_r(i_7766,i_6530,16,&coea_i,&coeb_i,&coer_i);

	for(j=0;j<16;j++)
	{
		if((v_6530[j] > 0.0001) && (v_7766[j] > 0.0001))
		{
			ac6530_com_v += v_6530[j];
			self_com_v += v_7766[j];
			k++;
		}
	}

	ac6530_com_v /= k;
	self_com_v /= k;

	self_adjust_comv = ac6530_com_v - self_com_v;

	if((coer_pl > 0.9) && (coer_i > 0.9) && (coer_ph > 0.9))
	{
		self_adjust_coea_pl = coea_pl;
		self_adjust_coeb_pl = coeb_pl;
		self_adjust_coer_pl = coer_pl;

		self_adjust_coea_ph = coea_ph;
		self_adjust_coeb_ph = coeb_ph;
		self_adjust_coer_ph = coer_ph;

		self_adjust_coea_i = coea_i;
		self_adjust_coeb_i = coeb_i;
		self_adjust_coer_i = coer_i;
		write_coe_from_flash();
		ret = 1;
	}

	lcd_show_coe_abr_info(coea_pl,coeb_pl,coer_pl);

	memset(ch_sta,0x00, sizeof(ch_sta));
	operate_ch_relay(ch_sta);
	if(ret)
	{
		return 1;
	}

	return 0;
}

int32_t Go_external_adjust(void)
{
	uint8_t ad_sta = EXTERNAL_START;

	uint8_t ch_sta[16] = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};//1 2 3 4 5 6 7 8 9 10 60 60 600 600 600 600 600 600
	//uint32_t load_size[28] = {1,2,3,4,5,6,7,8,9,10,15,60,120,600,660,720,1200,1260,1320,1800,1860,1920,2400,2460,2520,3000,3060,3160};
	uint32_t load_size[16] = {1,3,6,12,20,50,70,100,170,500,600,1000,1500,2000,2500,3000};
	uint32_t load_cnt = 16;
	uint8_t read_count = 0;
	uint8_t read_c76_count = 0;
	uint8_t err_cnt = 0;
	uint32_t len = 0;

	uint8_t c  = 0;
	uint8_t ret = 0;
	uint8_t i = 0,j = 0,k = 0;
	uint8_t p_cnt = 0,v_cnt = 0,i_cnt = 0;
	uint8_t m = 0;
	uint8_t self_buf[120] = {0};
	uint8_t exter_buf[50] = {0};

	uint8_t test_buf[20] = {0};
	uint8_t test_buf_b[10] = {0};

	double ex_coea_p = 0;
	double ex_coeb_p = 0;
	double ex_coer_p = 0;

	double ex_coea_i = 0;
	double ex_coeb_i = 0;
	double ex_coer_i = 0;

	double self_p[28] = {0};
	double self_v[28] = {0};
	double self_i[28] = {0};

	double self_pp[28] = {0};
	//double self_vv[28] = {0};
	double self_ii[28] = {0};

	double exter_p[28] = {0};
	double exter_v[28] = {0};
	double exter_i[28] = {0};

	double exter_pp[28] = {0};
	double exter_vv[28] = {0};
	double exter_ii[28] = {0};

	double self_p_tmp[10] = {0};
	double self_v_tmp[10] = {0};
	double self_i_tmp[10] = {0};

	double exter_com_v = 0;
	double self_com_v = 0;

	count_time_flag = 0;
	if(ad_sta==EXTERNAL_START)
	{
		External_usart_write((uint8_t *)"AT+C76START\r\n",13);
		Debug_usart_write((uint8_t *)"AT+C76START\r\n",13,INFO_DEBUG);
		while(1)
		{

			len = pool_recv_one_command(&externalrx,exter_buf,6,EXTERNAL_POOL);
			if(len > 0)
			{
				Debug_usart_write((uint8_t *)"AT+C76START Recv:",17,INFO_DEBUG);
				Debug_usart_write(exter_buf,len,INFO_DEBUG);
				Debug_usart_write((uint8_t *)"\r\n",2,INFO_DEBUG);
				if(strncmp((const char *)exter_buf,(const char *)"\r\nOK",(size_t)4)==0)
				{
					err_cnt = 0;
					ad_sta++;
					break;
				}
			}
			else
			{
#if 0
				if(err_cnt < 3)
				{
					External_usart_write((uint8_t *)"AT+C76START\r\n",13);
					Debug_usart_write((uint8_t *)"AT+C76START\r\n",13,INFO_DEBUG);
					err_cnt++;
				}
				else
				{
					return -3;
				}
#endif
			}

			if(count_time_flag==1)
			{
				read_count++;
				External_usart_write((uint8_t *)"AT+C76START\r\n",13);
				if(read_count >= 3)
				{
					read_count = 0;
					Debug_usart_write("recv c76 outtime\r\n",18,INFO_DEBUG);
					count_time_flag = 0;
					return -3;
				}
				count_time_flag = 0;
			}
		}
	}

	read_count = 0;

	if(ad_sta==EXTERNAL_READ_NOW)
	{
		for(i=0;i<load_cnt;i++)
		{
			change_load_size(ch_sta,load_size[i]);
			operate_ch_relay(ch_sta);
			memset(ch_sta,0x00, sizeof(ch_sta));
			//memset(self_p,0x00, sizeof(self_p));
			//memset(self_v,0x00, sizeof(self_v));
			//memset(self_i,0x00, sizeof(self_i));
			memset(self_buf,0x00, sizeof(self_buf));
			pool_recv_one_command(&externalrx,exter_buf,50,EXTERNAL_POOL);

			k = 0;
			j = 0;
			read_c76_count = 0;
			external_wait_flag = 0;
			while(1)
			{
				Debug_usart_write("wait chx change\r\n",17,'Y');
				if(external_wait_flag==1)
				{
					read_count++;
					if(read_count >= 7)
					{
						read_count = 0;
						break;
					}
					external_wait_flag = 0;
				}
			}

			initDataPool(&externalrx);
			initDataPool(&cse7766rx);
			External_usart_write((uint8_t *)"AT+C76CAPTURE\r\n",15);
			Debug_usart_write((uint8_t *)"AT+C76CAPTURE\r\n",15,'Y');
			while(1)
			{
				memset(exter_buf,0x00, sizeof(exter_buf));
				len = pool_recv_one_command(&externalrx,exter_buf,6,EXTERNAL_POOL);
				if(len > 0)
				{
					Debug_usart_write((uint8_t *)"AT+C76CAPTURE Recv:",19,INFO_DEBUG);
					Debug_usart_write(exter_buf,len,INFO_DEBUG);
					Debug_usart_write((uint8_t *)"\r\n",2,INFO_DEBUG);
					//if(strncmp((const char *)exter_buf,(const char *)"\r\nOK",(size_t)4)==0)
					if(exter_buf[2]=='O' && exter_buf[3]=='K')
					{
						err_cnt = 0;
						break;
					}
					else
					{
						if(err_cnt < 3)
						{
							initDataPool(&externalrx);
							External_usart_write((uint8_t *)"AT+C76CAPTURE\r\n",13);
							Debug_usart_write((uint8_t *)"AT+C76CAPTURE\r\n",13,INFO_DEBUG);
							err_cnt++;
						}
						else
						{
							memset(ch_sta,0x00, sizeof(ch_sta));
							operate_ch_relay(ch_sta);
							return -3;
						}
					}
				}

				if(count_time_flag==1)
				{
					read_count++;
					if(read_count >= 3)
					{
						read_count = 0;
						Debug_usart_write("recv c76 outtime\r\n",18,INFO_DEBUG);
						count_time_flag = 0;
						memset(ch_sta,0x00, sizeof(ch_sta));
						operate_ch_relay(ch_sta);
						return -3;
					}
					count_time_flag = 0;
				}
			}

