hxming123456/stm32_power_measure_project/Power_measurement_self_fitting_v1.0/Power_measurement_self_fitting_v1.0/Power_measurement_self_fitting_v1.0/src/main.c
			initDataPool(&cse7766rx);
			//initDataPool(&externalrx);
			count_time_flag = 0;

			while(1)
			{
#if 0
				if(load_size[i] > 0)
				{
					read_count = 0;
					while(1)
					{
						if(count_time_flag==1)
						{
								read_count++;
								if(read_count >= 10)
								{
									//memset(ch_sta,0x00, sizeof(ch_sta));
									//operate_ch_relay(ch_sta);
									Debug_usart_write("read 7766 error\r\n",17,INFO_DEBUG);
									return -1;
								}
								count_time_flag = 0;
						}
						pool_recv_one_command(&cse7766rx,&self_buf[24*j],24,CSE_7766_POOL);
						ret = Check_data_is_error(&self_buf[24*j],24);
						if(ret==1)
						{
							j++;
							if(j==5)
							{
								break;
							}
							count_time_flag = 0;
						}
						else
						{
							if(self_buf[24*j]!=0)
							{
								memset(&self_buf[24*j],0x00,24);
							}
						}
					}
				}
#endif
				for(j=0;j<5;j++)
				{
					if(load_size[i]>0)
					{
						count_time_flag = 0;
						while(1)
						{
							if(count_time_flag==1)
							{
								read_count++;
								if(read_count >= 10)
								{
									memset(&self_buf[24*j],0x00, 24);
									memset(ch_sta,0x00, sizeof(ch_sta));
									operate_ch_relay(ch_sta);
									break;
								}
								count_time_flag = 0;
							}
							pool_recv_one_command(&cse7766rx,&self_buf[24*j],24,CSE_7766_POOL);
							Debug_usart_write(&self_buf[24*j],24,CSE7766_DEBUG);
							ret = Check_data_is_error(&self_buf[24*j],24);
							if(ret==1)
							{
								break;
							}
						}
					}
				}
				memset(exter_buf,0x00, sizeof(exter_buf));
				len = pool_recv_one_command(&externalrx,exter_buf,50,EXTERNAL_POOL);
				if(len > 0)
				{
					Debug_usart_write("recv c76 pvi:",13,INFO_DEBUG);
					Debug_usart_write(exter_buf,len,INFO_DEBUG);
					Debug_usart_write("\r\n",2,INFO_DEBUG);
					break;
				}
				if(count_time_flag==1)
				{
					read_c76_count++;
					if(read_c76_count >= 15)
					{
						memset(ch_sta,0x00, sizeof(ch_sta));
						operate_ch_relay(ch_sta);
						count_time_flag = 0;
						return -2;
					}
					count_time_flag = 0;
				}
			}

			for(m=0;m<j;m++)
			{
				if(Get_origin_pvi(&self_buf[24*m],24,&self_p_tmp[m],&self_v_tmp[m],&self_i_tmp[m])==1)
				{
					k++;
				}
				else
				{
					self_p_tmp[m] = 0;
					self_v_tmp[m] = 0;
					self_i_tmp[m] = 0;
				}
			}
			//if(k==0)
			//{
			//	return -1;
			//}
			for(m=0;m<j;m++)
			{
				self_p[i] += self_p_tmp[m];
				self_v[i] += self_v_tmp[m];
				self_i[i] += self_i_tmp[m];

				flodou_to_string(self_p_tmp[m],test_buf,5,4);
				Debug_usart_write(test_buf,10,TEST_DEBUG);
				Debug_usart_write("\r\n",2,TEST_DEBUG);
			}

			c = k + '0';
			Debug_usart_write(&c,1,TEST_DEBUG);
			Debug_usart_write("\r\n",2,TEST_DEBUG);

			//flodou_to_string(self_p[i],test_buf,5,4);
			//Debug_usart_write(test_buf,10,TEST_DEBUG);
			//Debug_usart_write("\r\n",2,TEST_DEBUG);

			self_p[i] /= k;
			self_v[i] /= k;
			self_i[i] /= k;

			flodou_to_string(self_i[i],test_buf,5,4);
			Debug_usart_write(test_buf,10,TEST_DEBUG);
			Debug_usart_write("\r\n",2,TEST_DEBUG);

			flodou_to_string(self_p[i],test_buf,5,4);
			Debug_usart_write(test_buf,10,TEST_DEBUG);
			Debug_usart_write("\r\n",2,TEST_DEBUG);

			if(self_p[i] > 1000)
			{
				self_p[i] = self_p[i]*self_adjust_coea_ph+self_adjust_coeb_ph;
			}
			else
			{
				self_p[i] = self_p[i]*self_adjust_coea_pl+self_adjust_coeb_pl;
			}
			self_i[i] = self_i[i]*self_adjust_coea_i+self_adjust_coeb_i;
			self_v[i] += self_adjust_comv;

			flodou_to_string(self_p[i],test_buf,4,4);
			Debug_usart_write(test_buf,9,TEST_DEBUG);
			Debug_usart_write("\r\n",2,TEST_DEBUG);

			if(Get_computer_external_pvi(exter_buf,len,&exter_p[i],&exter_v[i],&exter_i[i])==0)
			{
				return -4;
			}

			flodou_to_string(exter_p[i],test_buf,4,4);
			Debug_usart_write(test_buf,9,TEST_DEBUG);
			Debug_usart_write("\r\n\r\n",4,TEST_DEBUG);


			lcd_change_percent_info(6*i);
		}

		lcd_change_percent_info(100);
#if 1
		Debug_usart_write("\r\n",2,TEST_DEBUG);
#endif
		for(m=0;m<load_cnt;m++)
		{
			if(exter_p[m] > 0.0001 && self_p[m] > 0.0001)
			{
				exter_pp[p_cnt] = exter_p[m];
				self_pp[p_cnt] = self_p[m];
				p_cnt++;
			}
			if(exter_i[m] > 0.0001 && self_i[m] > 0.0001)
			{
				exter_ii[i_cnt] = exter_i[m];
				self_ii[i_cnt] = self_i[m];
				i_cnt++;
			}
			if(self_v[m] > 0.0001 && exter_v[m] > 0.0001)
			{
				k++;
				exter_com_v += exter_v[m];
				self_com_v += self_v[m];
			}
		}

		for(m=0;m<p_cnt;m++)
		{
			flodou_to_string(exter_pp[m],test_buf_b,Get_double_mantissa_len(&exter_pp[m]),3);
			Debug_usart_write(test_buf_b,9,TEST_DEBUG);
			Debug_usart_write("\r\n",2,TEST_DEBUG);
		}
		Debug_usart_write("\r\n",2,TEST_DEBUG);
		for(m=0;m<p_cnt;m++)
		{
			flodou_to_string(self_pp[m],test_buf_b,Get_double_mantissa_len(&self_pp[m]),3);
			Debug_usart_write(test_buf_b,9,TEST_DEBUG);
			Debug_usart_write("\r\n",2,TEST_DEBUG);
		}
		Debug_usart_write("\r\n",2,TEST_DEBUG);
		for(m=0;m<i_cnt;m++)
		{
			flodou_to_string(exter_ii[m],test_buf,Get_double_mantissa_len(&exter_ii[m]),3);
			Debug_usart_write(test_buf,9,TEST_DEBUG);
			Debug_usart_write("\r\n",2,TEST_DEBUG);
		}

		Debug_usart_write("\r\n",2,TEST_DEBUG);

		for(m=0;m<i_cnt;m++)
		{
			flodou_to_string(self_ii[m],test_buf_b,Get_double_mantissa_len(&self_ii[m]),3);
			Debug_usart_write(test_buf_b,9,TEST_DEBUG);
			Debug_usart_write("\r\n",2,TEST_DEBUG);
		}

		Debug_usart_write("\r\n",2,TEST_DEBUG);

		exter_com_v /= k;
		self_com_v /= k;
		external_adjust_comv = self_com_v - exter_com_v;

		Get_coe_a_b_r(exter_pp,self_pp,p_cnt,&ex_coea_p,&ex_coeb_p,&ex_coer_p);
		Get_coe_a_b_r(exter_ii,self_ii,i_cnt,&ex_coea_i,&ex_coeb_i,&ex_coer_i);

		if((ex_coer_p > 0.9) && (ex_coer_i > 0.9))
		{
			if((ex_coea_p > 0.7 && ex_coea_p < 1.5) && (ex_coea_i > 0.7 && ex_coea_i < 1.5))
			{
				if((ex_coeb_p > -2 && ex_coeb_p < 2) && (ex_coeb_i > -0.05 && ex_coeb_i < 0.05))
				{
					Send_result_to_c76(1,ex_coea_p,ex_coeb_p,ex_coea_i,ex_coeb_i,external_adjust_comv);
					ret = 1;
				}
				else
				{
					Send_result_to_c76(0,ex_coea_p,ex_coeb_p,ex_coea_i,ex_coeb_i,external_adjust_comv);
					ret = 0;
				}
			}
			else
			{
				Send_result_to_c76(0,ex_coea_p,ex_coeb_p,ex_coea_i,ex_coeb_i,external_adjust_comv);
				ret = 0;
			}
		}
		else
		{
			Send_result_to_c76(0,ex_coea_p,ex_coeb_p,ex_coea_i,ex_coeb_i,external_adjust_comv);
			ret = 0;
		}

